In [1]:
# Importing dependencies

import pandas as pd
from sqlalchemy import create_engine
from config import db_username, db_password
import numpy as np

# Path to postgres education_database
database_path = f"postgresql://{db_username}:{db_password}@localhost:5432/education_db"
database_path

'postgresql://postgres:Learning123*@localhost:5432/education_db'

In [7]:
# Create an engine that can talk to the database
engine = create_engine(database_path)
conn = engine.connect()

In [12]:
# Querying from a view of combined datsets in the database
conn.execute('SELECT * FROM fips_census_education')

In [13]:
engine

Engine(postgresql://postgres:***@localhost:5432/education_db)

In [8]:
# Importing data files

coordinates_df = pd.read_csv("resources/us_state_capitals.csv")

coordinates_df.head()

  _key        name      capital        lat        long
0   AL     Alabama   Montgomery  32.361538  -86.279118
1   AK      Alaska       Juneau  58.301935 -134.419740
2   AZ     Arizona      Phoenix  33.448457 -112.073844
3   AR    Arkansas  Little Rock  34.736009  -92.331122
4   CA  California   Sacramento  38.555605 -121.468926

In [17]:
# Rename column
# df=df.rename(columns = {'two':'new_name'})

coordinates_df = coordinates_df.rename(columns = {'_key':'abbr', 'name':'state'})
coordinates_df.head()

  abbr       state      capital        lat        long
0   AL     Alabama   Montgomery  32.361538  -86.279118
1   AK      Alaska       Juneau  58.301935 -134.419740
2   AZ     Arizona      Phoenix  33.448457 -112.073844
3   AR    Arkansas  Little Rock  34.736009  -92.331122
4   CA  California   Sacramento  38.555605 -121.468926

In [18]:
census_df = pd.read_sql("""SELECT state, ROUND(AVG(poverty_count),2) AS avg_poverty_count, 
        ROUND(AVG(per_capita_income),2) AS avg_per_capita_income, 
        ROUND(AVG(bachelors_or_higher_2019),2) AS avg_bachelors_or_higher_2019
        FROM fips_census_education
        GROUP BY state
        ORDER BY state;""",conn)
census_df.head()

,state,avg_poverty_count,avg_per_capita_income,avg_bachelors_or_higher_2019
0,Alabama,11880.43,24049.15,12623.46
1,Arizona,69584.27,24500.27,92968.40
2,Arkansas,6616.80,23285.04,6176.48
3,California,88788.66,33798.62,154840.10
4,Colorado,8841.77,31972.55,24455.22

In [21]:
# Merging county and query data for leaflet

merged_df = pd.merge(census_df, coordinates_df, how='inner', on=['state'])
merged_df.head()

,state,avg_poverty_count,avg_per_capita_income,avg_bachelors_or_higher_2019,abbr,capital,lat,long
0,Alabama,11880.43,24049.15,12623.46,AL,Montgomery,32.361538,-86.279118
1,Arizona,69584.27,24500.27,92968.40,AZ,Phoenix,33.448457,-112.073844
2,Arkansas,6616.80,23285.04,6176.48,AR,Little Rock,34.736009,-92.331122
3,California,88788.66,33798.62,154840.10,CA,Sacramento,38.555605,-121.468926
4,Colorado,8841.77,31972.55,24455.22,CO,Denver,39.739167,-104.984167

In [22]:
# Save as a csv
# Note to avoid any issues later, use encoding="utf-8"
merged_df.to_csv("resources/cleaned_states_coordinates.csv", encoding="utf-8", index=False)